var areaList={
"全部-0":[["选择城区","0"]], 
"北京-101":[["选择城区","0"]], 
"天津-102":[["选择城区","0"]], 
"上海-109":[["选择城区","0"]], 
"重庆-122":[["选择城区","0"]], 
"西藏-126":[["选择城区","0"],["阿里","8073"],["昌都","895"],["拉萨","891"],["林芝","894"],["那曲","896"],["日喀则","892"],["山南","893"]], 
"新疆-131":[["选择地区","0"],["阿克苏","997"],["阿拉尔","997"],["巴音郭楞蒙古自治州","996"],["博尔塔拉蒙古自治州","909"],["昌吉回族自治州","994"],["哈密","902"],["和田","903"],["喀什","998"],["克拉玛依","990"],["克孜勒苏柯尔克孜自治州","908"],["石河子","993"],["图木舒克","998"],["吐鲁番","995"],["乌鲁木齐","991"],["奎屯","992"],["五家渠","994"],["伊犁哈萨克自治州","999"]], 
"内蒙古-105":[["选择地区","0"],["阿拉善盟","483"],["巴彦淖尔盟","478"],["包头","472"],["赤峰","476"],["呼和浩特","471"],["呼伦贝尔","470"],["通辽","475"],["乌海","473"],["乌兰察布盟","474"],["锡林郭勒盟","479"],["兴安盟","482"],["鄂尔多斯","477"]], 
"广西-120":[["选择地区","0"],["百色","776"],["北海","779"],["崇左","771"],["防城港","770"],["桂林","773"],["贵港","775"],["河池","778"],["贺州","774"],["来宾","772"],["柳州","772"],["南宁","771"],["钦州","777"],["梧州","774"],["玉林","775"]], 
"宁夏-130":[["选择地区","0"],["固原","954"],["石嘴山","952"],["吴忠","953"],["银川","951"]], 
"山西-104":[["选择地区","0"],["长治","355"],["大同","352"],["晋城","356"],["晋中","354"],["临汾","357"],["吕梁","358"],["朔州","349"],["太原","351"],["忻州","350"],["阳泉","353"],["运城","359"]], 
"河南-116":[["选择地区","0"],["安阳","372"],["鹤壁","392"],["济源","391"],["焦作","391"],["洛阳","379"],["南阳","377"],["开封","378"],["平顶山","375"],["三门峡","398"],["商丘","370"],["信阳","376"],["新乡","373"],["许昌","374"],["郑州","371"],["周口","394"],["驻马店","396"],["漯河","395"],["濮阳","393"]], 
"河北-103":[["选择地区","0"],["保定","312"],["沧州","317"],["邯郸","310"],["承德","314"],["衡水","318"],["秦皇岛","335"],["廊坊","316"],["石家庄","311"],["唐山","315"],["邢台","319"],["张家口","313"]], 
"江西-114":[["选择地区","0"],["抚州","794"],["赣江","797"],["吉安","796"],["景德镇","798"],["九江","792"],["南昌","791"],["上饶","793"],["萍乡","799"],["新余","790"],["宜春","795"],["鹰潭","701"]], 
"湖南-118":[["选择地区","0"],["常德","736"],["长沙","731"],["郴州","735"],["衡阳","734"],["怀化","745"],["娄底","738"],["邵阳","743"],["湘潭","731"],["湘西土家族苗族自治州","743"],["益阳","737"],["永州","746"],["岳阳","730"],["张家界","744"],["株洲","735"]], 
"江苏-110":[["选择地区","0"],["常州","519"],["连云港","518"],["淮安","517"],["南京","25"],["南通","513"],["苏州","512"],["宿迁","527"],["泰州","523"],["无锡","510"],["徐州","516"],["盐城","515"],["扬州","514"],["镇江","511"]], 
"浙江-111":[["选择地区","0"],["杭州","571"],["湖州","572"],["嘉兴","573"],["金华","579"],["丽水","578"],["宁波","574"],["绍兴","575"],["台州","576"],["温州","577"],["舟山","580"],["衢州","570"]], 
"安徽-112":[["选择地区","0"],["安庆","556"],["蚌埠","552"],["巢湖","565"],["池州","566"],["滁州","550"],["阜阳","558"],["合肥","551"],["淮北","561"],["淮南","554"],["黄山","559"],["六安","564"],["马鞍山","555"],["宿州","557"],["铜陵","562"],["芜湖","553"],["宣城","563"],["亳州","558"]], 
"湖北-117":[["选择地区","0"],["鄂州","711"],["恩施土家族苗族自治州","718"],["黄冈","713"],["黄石","714"],["荆门","727"],["荆州","716"],["神农架林区","719"],["潜江","728"],["十堰","719"],["随州","722"],["天门","728"],["武汉","27"],["咸宁","715"],["仙桃",""],["襄樊","710"],["孝感","712"],["宜昌","717"]], 
"黑龙江-108":[["选择地区","0"],["大庆","459"],["大兴安岭","457"],["哈尔滨","451"],["鹤岗","454"],["黑河","456"],["鸡西","453"],["佳木斯","454"],["牡丹江","453"],["七台河","453"],["齐齐哈尔","452"],["双鸭山","454"],["绥化 ","455"],["伊春","458"]], 
"吉林-107":[["选择地区","0"],["白城","436"],["白山","439"],["长春","431"],["吉林","431"],["辽源","437"],["四平","434"],["松原","438"],["通化","435"],["延边朝鲜族自治州","433"]], 
"辽宁-106":[["选择地区","0"],["鞍山","555"],["本溪","414"],["朝阳","421"],["大连","456"],["丹东","415"],["抚顺","413"],["阜新","418"],["葫芦岛","429"],["锦州","416"],["辽阳","419"],["盘锦","427"],["沈阳","24"],["铁岭","410"],["营口","417"]], 
"陕西-127":[["选择地区","0"],["安康","915"],["宝鸡","917"],["汉中","916"],["商洛","914"],["铜川","919"],["西安","29"],["渭南","913"],["咸阳","910"],["延安","911"],["榆林","912"]], 
"甘肃-128":[["选择地区","0"],["白银","943"],["定西","932"],["甘南藏族自治区","941"],["嘉峪关","937"],["金昌","935"],["酒泉","937"],["兰州","931"],["临夏回族自治区","930"],["陇南","930"],["平凉","943"],["庆阳","9441"],["天水","938"],["武威","935"],["张掖","936"]], 
"青海-129":[["选择地区","0"],["果洛藏族自治州","975"],["海北藏族自治州","970"],["海东","972"],["海南藏族自治州","974"],["海西蒙古族藏族自治州","979"],["黄南藏族自治州","973"],["西宁","971"],["玉树藏族自治州","976"]], 
"云南-125":[["选择地区","0"],["保山","875"],["楚雄彝族自治州","878"],["大理白族自治州","872"],["德宏傣族景颇族自治州","692"],["迪庆藏族自治州","887"],["红河哈尼族彝族自治州","873"],["昆明","871"],["丽江","888"],["临沧","883"],["怒江傈僳族自治州","886"],["曲靖","874"],["思茅","879"],["文山壮族苗族自治州","876"],["西双版纳傣族自治州","691"],["玉溪","877"],["昭通","870"]], 
"贵州-124":[["选择地区","0"],["安顺","853"],["毕节","857"],["贵阳","851"],["六盘水","858"],["黔东南苗族侗族自治州","855"],["黔南布依族苗族自治州","854"],["铜仁","856"],["遵义","852"],["黔西南布依族苗族自治州","859"]], 
"四川-123":[["选择地区","0"],["阿坝藏族羌族自治州","837"],["巴中","8279"],["德阳","838"],["成都","28"],["达州","818"],["甘孜藏族自治州","836"],["广安","826"],["广元","839"],["乐山","833"],["凉山彝族自治州","834"],["眉山","833"],["绵阳","816"],["南充","817"],["内江","832"],["攀枝花","812"],["遂宁","825"],["雅安","835"],["宜宾","831"],["资阳","832"],["自贡","813"],["泸州","830"]], 
"福建-113":[["选择地区","0"],["福州","591"],["龙岩","597"],["南平","599"],["宁德","593"],["莆田","594"],["泉州","595"],["三明","598"],["漳州","596"],["厦门","592"]], 
"山东-115":[["选择地区","0"],["滨州","543"],["德州","534"],["东营","546"],["荷泽","530"],["济南","531"],["济宁","537"],["莱芜","634"],["聊城","635"],["临沂","539"],["青岛","532"],["日照","633"],["泰安","538"],["威海","631"],["潍坊","536"],["烟台","535"],["枣庄","632"],["淄博","533"]], 
"广东-119":[["选择地区","0"],["潮州","768"],["东莞","769"],["佛山","757"],["广州","20"],["河源","762"],["江门","750"],["揭阳","663"],["惠州","752"],["茂名","668"],["梅州","753"],["清远","763"],["汕头","754"],["汕尾","660"],["韶关","751"],["深圳","755"],["阳江","662"],["云浮","766"],["湛江","759"],["肇庆","758"],["中山","760"],["珠海","756"]], 
"海南-121":[["选择地区","0"],["白沙黎族自治县","898"],["保亭黎族苗族自治县","898"],["昌江黎族自治县","898"],["澄迈县","898"],["定安县","898"],["海口","898"],["东方","890"],["乐东黎族自治县","898"],["临高县","898"],["陵水黎族自治县","898"],["琼海","898"],["琼中黎族苗族自治县","898"],["三亚","899"],["屯昌县","898"],["万宁","898"],["文昌","898"],["五指山","898"],["儋州","890"]], 
"其它-1000":[["其它","0"]] 
}; 

var sk=0; 
var fd=0; 
var skk; 
var ix=0; 
var sx=0;  
var sf=document.getElementById("azone"); 
var optn=document.getElementById("cls"); 
var inps=document.getElementById('inps'); 

function inti(n){ 
	sk=0; 
	fd=0; 
	if(n==0){ 
		sf=document.getElementById("azone"); 
		optn=document.getElementById("cls"); 
		inps=document.getElementById('inps'); 
		sx=0;
		ix=0; 
	} 
	if(n==1){ 
		sf=document.getElementById("azone1"); 
		optn=document.getElementById("cls1"); 
		inps=document.getElementById('inps1'); 
		sx=0;
		ix=0; 
	} 
	if(n==2){ 
		sf=document.getElementById("azone2"); 
		optn=document.getElementById("cls2"); 
		inps=document.getElementById('inps2'); 
		sx=0;
		ix=0; 
	} 
	if(sf.options.length<2){
		for(name in areaList){
			namestr = name.split("-")
			sf.options[sk++]=new Option(namestr[0],namestr[1]); 
		}
	} 
	return true; 
} 

window.onload=function(){ 
	for(nx=0;nx<2;nx++){ 
		inti(1);
		sf.selectedIndex=sx; 
		// sf.value=sf.options[sf.selectedIndex].innerText; 
		altcls(1); 
		optn.selectedIndex=ix; 
		optn.value=optn.options[optn.selectedIndex].value; 
		inps.value=optn.options[optn.selectedIndex].value; 
	} 
	if(document.getElementById("azone2") != null){
		for(nx=0;nx<2;nx++){ 
			inti(2);
			sf.selectedIndex=sx; 
			// sf.value=sf.options[sf.selectedIndex].innerText; 
			altcls(2); 
			optn.selectedIndex=ix; 
			optn.value=optn.options[optn.selectedIndex].value; 
			inps.value=optn.options[optn.selectedIndex].value; 
		}
	} 
} 

function altcls(type){
	if(type == 1){
		sf=document.getElementById("azone1"); 
		optn=document.getElementById("cls1"); 
		inps=document.getElementById('inps1'); 
	}else{
		sf=document.getElementById("azone2"); 
		optn=document.getElementById("cls2"); 
		inps=document.getElementById('inps2'); 
	}
	var tmpcls=areaList[sf.options[sf.selectedIndex].innerText+'-'+sf.value];
	var fs=0; 
	optn.innerHTML=''; 
	if(sf.value=="省份"){ 
		optn.options[0]=new Option("←选左边",0); 
	}else{
		try{if(tmpcls[0][0].indexOf("选择城区")!=-1)fs++;}catch(e){} 
		optn.options[0]=new Option("选取地区",0); 
		optn.options[0].disabled="disabled";optn.options[0].style.color="#060"; 
		for(i=0;i<tmpcls.length;i++){
			if(typeof(tmpcls[i][0])!="undefined"&&tmpcls[i][0].length>1){ 
				optn.options[i]=new Option(tmpcls[i][0],tmpcls[i][1]); 
				if(tmpcls[i][1]==inps.value){ 
					optn.selectedIndex=i;fd=1;if((++fs)==2){optn.selectedIndex=0;fs=1;}
				}
			}else{
				optn.options[i]=new Option(tmpcls[i],tmpcls[i]); 
			} 
		}
	} 
	return; 
} 

function findarea(){ 
sk=0; 
if(inps.value.substring(0,1)>0)inps.value=inps.value; 
for(name in areaList){ 
sf.options[sk++]=new Option(name,name); 
sf.value=sf.options[sk-1].value; 
altcls(); 
if(fd==1){fd=0;sf.selectedIndex=sk-1;break;} 
} 
} 
